Repository: bozhink/Translations
Catalog: Scilab/scilab/modules/data_structures/locales/data_structures-*.po
Languages: bg

source: An hypermatrix extraction must have at least 2 arguments.
bg: Извличането на хиперматрица трябва да има поне 2 аргумента.

source: Argument is not an hypermatrix.
bg: Аргументът не е хиперматрица.

source: Incompatible hypermatrix extraction.
bg: Несъвместимо извличане на хиперматрица.

source: Bad (%d th) index in hypermatrix extraction.
bg: Некоректен (%d-ти) индекс в извличането на хиперматрица.

source: An hypermatrix insertion must have at least 3 arguments.
bg: Вмъкването на хиперматрица трябва да има поне 3 аргумента.

source: Bad hypermatrix insertion.
bg: Некоректно вмъкване на хиперматрица.

source: Too many arguments in the stack, edit stack.h and enlarge intersiz.
bg: Твърде много аргументи в стека, зедактирайте stack.h и увеличете intersiz.

source: %s: Wrong values for input argument #%d: Elements must be non-negative integers.
bg: %s: Невалидни стойности на входен аргумент #%d: Елементите трябва да бъдат неотрицателни цели числа.

source: %s: Number of entries does not match product of dimensions
bg: %s: Броят на входните компоненти не съвпада с произведението на размерностите

source: %s: Wrong number of input arguments: %d expected
bg: %s: Невалиден брой на входните аргументи: Очакват се %d

source: %s: Wrong number of input argument(s): %d expected.
bg: %s: Невалиден брой на входните аргументи: Очакват се %d.

source: %s: Wrong type for input argument #%d: struct array expected.
bg: %s: Невалиден тип на входен аргумент #%d: Очаква се масив от struct.

source: %s: Wrong type for input argument #%d: A string expected.
bg: %s: Невалиден тип на входен аргумент #%d: Очаква се низ.

source: %s: Wrong number of input argument(s) : an even number is expected.
bg: %s: Невалиден брой на входните аргументи : Очаква се четен брой.

source: %s: 'dims' can not be used as a field name.
bg: %s: 'dims' не може да се използва като име на поле.

source: %s: field name '%s' defined twice.
bg: %s: поле с име '%s' е дефинирано два пъти.
