Repository: bozhink/Translations
Catalog: Scilab/scilab/modules/linear_algebra/locales/linear_algebra-*.po
Languages: bg

source: %s: Wrong type for input argument #%d: Real or Complex matrix expected.
bg: %s: Невалиден тип на входен аргумент #%d: Очаква се реална или комплексна матрица.

source: %s: Non convergence in QR steps.
bg: %s: Няма сходимост в QR стъпките.

source: %s: Wrong type for input argument #%d: Real matrix expected.
bg: %s: Невалиден тип на входен аргумент #%d: Очаква се реална матрица.

source: %s: Wrong size for input argument #%d: A square matrix expected.
bg: %s: Невалиден размер на входен аргумент #%d: Очаква се квадратна матрица.

source: %s: Wrong size for input argument #%d: A scalar expected.
bg: %s: Невалиден размер на входен аргумент #%d: Очаква се скалар.

source: %s: Wrong values for input argument #%d: Non-negative integers expected.
bg: %s: Невалидни стойности на входен аргумент #%d: Очакват се неотрицателни цели числа.

source: %s: Wrong size for input argument #%d: A column vector expected.
bg: %s: Невалиден размер на входен аргумент #%d: Очаква се вектор-стълб.

source: %s: Incompatible input arguments #%d and #%d: Same sizes expected.
bg: %s: Несъвместими входни аргументи #%d и #%d: Очакват се еднакви размери.

source: %s: Wrong number of input arguments: %d or %d expected.
bg: %s: Невалиден брой на входните аргументи: Очакват се %d или %d.

source: %s: Wrong value for input argument #%d: Must be in the set {%s}.
bg: %s: Невалидна стойност на входен аргумент #%d: Трябва да бъде в множеството {%s}.

source: %s: Wrong number of input argument(s): %d expected.
bg: %s: Невалиден брой на входните параметри: Очакват се %d.

source: %s: Wrong value for input argument #%d: Non-negative integer expected.
bg: %s: Невалидна стойност на входен аргумент #%d: Очаква се неотрицателно цяло число.

source: %s: Wrong values for input argument #%d: Non-negative scalar expected.
bg: %s: Невалидни стойности на входен аргумент #%d: Очаква се неотрицателен скалар.

source: %s: Wrong size for input argument #%d: Symmetric expected
bg: %s: Невалиден размер на входен аргумент #%d: Очаква се симетричен

source: %s: Wrong type for input argument #%d.
bg: %s: Невалиден тип на входен аргумент #%d.

source: %s: Wrong value for input argument #%d: Requested rank is greater than matrix dimension.
bg: %s: Невалидна стойност на входен аргумент #%d: Поисканият ранг е по-голям от размерността на матрицата.
